TexasInstruments/mcupsdk-core/test/drivers/ipc_rpmsg/ipc_rpmsg_test_am263x/test_ipc_rpmsg_am263.c
/*
 *  Copyright (C) 2021 Texas Instruments Incorporated
 *
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions
 *  are met:
 *
 *    Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the
 *    distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 *  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 *  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 *  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
 *  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 *  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 *  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 *  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 *  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 *  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 *  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include <stdio.h>
#include <string.h>
#include <inttypes.h>
#include <kernel/dpl/ClockP.h>
#include <kernel/dpl/SemaphoreP.h>
#include <drivers/soc.h>
#include <drivers/ipc_notify.h>
#include <drivers/ipc_rpmsg.h>
#include <unity.h>
#include "ti_drivers_open_close.h"
#include "test_ipc_rpmsg_am263.h"

extern uint8_t gRPMessageVringMem[12][1312];

RPMessage_Object gRecvMsgObject;

#define MAIN_CORE_ACK_REPLY_END_PT  (16U)
#define MAIN_CORE_ACK_REPLY_END_PT_DATALEN  (18U)

uint16_t gRemoteServiceEndPt = 15U;
uint16_t gdataLenServiceEndPt = 17U;
/* RPMessage_Object MUST be global or static */
//static RPMessage_Object gRecvMsgObject;

/* number of iterations of message exchange to do, this is only used by some tests */
uint32_t gMsgEchoCount = 10000;
uint32_t msg;

#if defined(SOC_AM64X)
/* main core that checks the test pass/fail */
uint32_t gMainCoreId = CSL_CORE_ID_R5FSS0_0;
/* All cores that participate in the IPC */
uint32_t gRemoteCoreId[] = {
    CSL_CORE_ID_R5FSS0_0,
    CSL_CORE_ID_R5FSS0_1,
    CSL_CORE_ID_R5FSS1_0,
    CSL_CORE_ID_R5FSS1_1,
    CSL_CORE_ID_M4FSS0_0,
    CSL_CORE_ID_A53SS0_0,
    CSL_CORE_ID_MAX /* this value indicates the end of the array */
};
#endif

#if defined(SOC_AM243X)
/* main core that checks the test pass/fail */
uint32_t gMainCoreId = CSL_CORE_ID_R5FSS0_0;
/* All cores that participate in the IPC */
uint32_t gRemoteCoreId[] = {
    CSL_CORE_ID_R5FSS0_0,
    CSL_CORE_ID_R5FSS0_1,
    CSL_CORE_ID_R5FSS1_0,
    CSL_CORE_ID_R5FSS1_1,
    CSL_CORE_ID_M4FSS0_0,
    CSL_CORE_ID_MAX /* this value indicates the end of the array */
};
#endif

#if defined(SOC_AM263X)
/* main core that checks the test pass/fail */
uint32_t gMainCoreId = CSL_CORE_ID_R5FSS0_0;
/* All cores that participate in the IPC */
uint32_t gRemoteCoreId[] = {
    CSL_CORE_ID_R5FSS0_0,
    CSL_CORE_ID_R5FSS0_1,
    CSL_CORE_ID_R5FSS1_0,
    CSL_CORE_ID_R5FSS1_1,
    CSL_CORE_ID_MAX /* this value indicates the end of the array */
};
#endif

#if defined(SOC_AM273X) || defined(SOC_AWR294X)
/* main core that checks the test pass/fail */
uint32_t gMainCoreId = CSL_CORE_ID_R5FSS0_0;
/* All cores that participate in the IPC */
uint32_t gRemoteCoreId[] = {
    CSL_CORE_ID_R5FSS0_0,
    CSL_CORE_ID_R5FSS0_1,
    CSL_CORE_ID_C66SS0,
    CSL_CORE_ID_MAX /* this value indicates the end of the array */
};
#endif

/* max size of message that will be ever sent */
#define MAX_MSG_SIZE    (128u)

/* name of server that is annoucned */
#define SERVER_NAME "rpmsg.server"

/* Temporary define for RPMsg send timeout(2 seconds) to fix code hang issue */
#define RPMSG_SEND_TIMEOUT (2 * 1000000)

/* semaphore that is set from callback handler when all sent messages in back to back mode are ack'ed */
SemaphoreP_Object gAckDoneSem;
/* semaphore that is set from callback handler when all sent messages in rx notify callback mode are ack'ed */
SemaphoreP_Object gRxNotifyAckDoneSem;
/* semaphore that is set from callback handler when all sent messages in rx notify callback mode are ack'ed */
SemaphoreP_Object gSendNotifyAckDoneSem;

/* server task related properties, like priority, stack size, stack memory, task object handles */
#define SERVER_TASK_PRI (2u)
#define SERVER_TASK_SIZE (16*1024/sizeof(StackType_t))
//StackType_t  gServerTaskStack[SERVER_TASK_SIZE] __attribute__((aligned(32)));
//StaticTask_t gServerTaskObj;
//TaskHandle_t gServerTask;

/* RPMessage objects to receive messages */
RPMessage_Object gServerMsgObject;
/* RPMessage objects to receive ack messages */
RPMessage_Object gClientMsgObject;
/* RPMessage objects to receive ack messages in back to back mode */
RPMessage_Object gAckMsgObject;
/* No messages are sent or received to this object, its used for error check tests */
RPMessage_Object gNullRpmsgObj;
/* RPMessage objects to receive ack messages in rx notify callback mode */
RPMessage_Object gRxNotifyAckMsgObject;
/* RPMessage_Object MUST be global or static */
RPMessage_Object gAckReplyMsgObject;
/* RPMessage_Object MUST be global or static */
RPMessage_Object gAckReplyMsgDataLenObject;

/* RPMessage end points for server, server acks, server acks in back to back mode */
uint16_t gServerEndPt = 10;
uint16_t gClientEndPt = 11;
uint16_t gAckEndPt    = 12;
uint16_t gNullEndPt   = 13; /* this end point is not created is used for error tests */
uint16_t gRxNotifyAckEndPt = 14;

/* one to one test args */
typedef struct {
    uint16_t remoteCoreId; /* core to test message exchange with */
    uint16_t msgSize;   /* size of message to exchange */
    uint32_t echoMsgCount; /* number of messages to exchange */
} Test_Args;

/* message that is sent in back to back test */
typedef struct {

    uint32_t curCount;
    uint32_t maxCount;

