TexasInstruments/mcupsdk-core/test/drivers/ipc_rpmsg/ipc_rpmsg_test_am263x/test_ipc_rpmsg_am263.c
} Msg_BackToBack;

typedef struct {

    uint16_t remoteEndPt;
    char remoteServiceName[32];

} ControlEndPt_Info;

ControlEndPt_Info gControlEndPt_info[CSL_CORE_ID_MAX];

/* Performance is calculated for 4 msg lengths (4,32,64,112) and from all remote cores */
#define MAX_IPC_RPMSG_PERF_CNT      ((CSL_CORE_ID_MAX-1) * 4)
typedef struct ipcPerfObj_s {
uint32_t remoteCoreId;
uint32_t msgSize;
uint64_t msgLatency;
} ipcPerfObj_t;
ipcPerfObj_t gIpcPerfObj[MAX_IPC_RPMSG_PERF_CNT] = {0};
uint32_t     gIpcPerfCnt = 0;

void test_rpmsgRxNotifyHandler(RPMessage_Object *obj, void *arg);

/* handle announcement messages and store in a global, these are checked later on */
void test_rpmsgControlEndPtCallback(void *arg,
    uint16_t remoteCoreId, uint16_t remoteEndPt, const char *remoteServiceName)
{
    ControlEndPt_Info *obj = (ControlEndPt_Info *)arg;

    if(remoteCoreId < CSL_CORE_ID_MAX)
    {
        obj[remoteCoreId].remoteEndPt = remoteEndPt;
        strncpy(obj[remoteCoreId].remoteServiceName, remoteServiceName, 32);
    }
}

/* Ack message handler when messages are sent back to back, here after required messages are received semaphore is posted */
void test_rpmsgAckHandler(RPMessage_Object *obj, void *arg, void *data, uint16_t dataLen, uint16_t remoteCoreId, uint16_t remoteEndPt)
{
    Msg_BackToBack *pMsg = (Msg_BackToBack*)data;

    if(pMsg->curCount == (pMsg->maxCount-1) )
    {
        SemaphoreP_Object *pDoneSem = (SemaphoreP_Object *)arg;

        SemaphoreP_post(pDoneSem);
    }
}


/* server task which simply echos the receive message back to the sender */
void echocallback(RPMessage_Object *obj, void *arg, void *data, uint16_t dataLen, uint16_t remoteCoreId, uint16_t remoteEndPt)
{
    int32_t status;

        /* echo the same message as reply */

        /* send ack to sender CPU at the sender end point */
        status = RPMessage_send(
            data, dataLen,
            remoteCoreId, remoteEndPt,
            RPMessage_getLocalEndPt(&gServerMsgObject),
            SystemP_WAIT_FOREVER);
        DebugP_assert(status==SystemP_SUCCESS);
}

/* create semaphores, rpmessage objects and tasks as needed */
void test_rpmsgCreateObjects()
{
    int32_t status;
    RPMessage_CreateParams createParams;

    status = SemaphoreP_constructBinary(&gAckDoneSem, 0);
    DebugP_assert(status==SystemP_SUCCESS);

    status = SemaphoreP_constructBinary(&gRxNotifyAckDoneSem, 0);
    DebugP_assert(status==SystemP_SUCCESS);

   /* RPMessage_CreateParams_init(&createParams);
    createParams.localEndPt = gServerEndPt;
    status = RPMessage_construct(&gServerMsgObject, &createParams);
    DebugP_assert(status==SystemP_SUCCESS); */

    RPMessage_CreateParams_init(&createParams);
    createParams.localEndPt = gServerEndPt;
    createParams.recvCallback = echocallback;
    status = RPMessage_construct(&gServerMsgObject, &createParams);
    DebugP_assert(status==SystemP_SUCCESS);

    RPMessage_CreateParams_init(&createParams);
    createParams.localEndPt = MAIN_CORE_ACK_REPLY_END_PT_DATALEN;
    status = RPMessage_construct(&gAckReplyMsgDataLenObject, &createParams);
    DebugP_assert(status==SystemP_SUCCESS);

    RPMessage_CreateParams_init(&createParams);
    createParams.localEndPt = gAckEndPt;
    createParams.recvCallback = test_rpmsgAckHandler;
    createParams.recvCallbackArgs = &gAckDoneSem;
    status = RPMessage_construct(&gAckMsgObject, &createParams);
    DebugP_assert(status==SystemP_SUCCESS);

    RPMessage_CreateParams_init(&createParams);
    createParams.localEndPt = gRxNotifyAckEndPt;
    createParams.recvNotifyCallback = test_rpmsgRxNotifyHandler;
    createParams.recvNotifyCallbackArgs = &gRxNotifyAckDoneSem;
    status = RPMessage_construct(&gRxNotifyAckMsgObject, &createParams);
    DebugP_assert(status==SystemP_SUCCESS);

    RPMessage_CreateParams_init(&createParams);
    createParams.localEndPt = gClientEndPt;
    status = RPMessage_construct(&gClientMsgObject, &createParams);
    DebugP_assert(status==SystemP_SUCCESS);

    memset(&gControlEndPt_info[0], 0, sizeof(ControlEndPt_Info));
    RPMessage_controlEndPtCallback(test_rpmsgControlEndPtCallback, &gControlEndPt_info[0]);

    /*gServerTask = xTaskCreateStatic(test_rpmsgServerMain,
                                  "test_rpmsgServerMain",
                                  SERVER_TASK_SIZE,
                                  NULL,
                                  SERVER_TASK_PRI,
                                  gServerTaskStack,
                                  &gServerTaskObj);
    configASSERT(gServerTask != NULL); */

    /* wait for all cores to be ready */
    IpcNotify_syncAll(SystemP_WAIT_FOREVER);

    DebugP_log("[TEST IPC RPMSG] Ready for IPC !!!\r\n");
}

/* delete all objects created in test_rpmsgCreateObjects
 * Note, on core other than main cores the server task never exists so objects are never deleted
 */
void test_rpmsgDestructObjects()
{
    //vTaskDelete(gServerTask);
    RPMessage_destruct(&gServerMsgObject);
    RPMessage_destruct(&gAckMsgObject);
    RPMessage_destruct(&gRxNotifyAckMsgObject);
    RPMessage_destruct(&gClientMsgObject);
    SemaphoreP_destruct(&gAckDoneSem);
    SemaphoreP_destruct(&gRxNotifyAckDoneSem);
}

void test_rpmsgControlEndPt(void *args)
{
    uint32_t remoteCoreId, i;

    /* wait a while we should definitely get annoucments within this time */
    ClockP_usleep(10*1000);

    /* validate server end pt annoucements */
    for(i=0; gRemoteCoreId[i]!=CSL_CORE_ID_MAX; i++ )
    {
        remoteCoreId = gRemoteCoreId[i];
        if(remoteCoreId != IpcNotify_getSelfCoreId())
        {
            TEST_ASSERT_EQUAL_UINT16(gServerEndPt, gControlEndPt_info[remoteCoreId].remoteEndPt);
            TEST_ASSERT_EQUAL_UINT32( 0, strcmp(gControlEndPt_info[remoteCoreId].remoteServiceName, SERVER_NAME) );
        }
    }
}

void test_rpmsgAnyToAny(void *args)
{
    uint32_t msg, i;
    static char msgBuf[MAX_MSG_SIZE];
    static char ackMsgBuf[MAX_MSG_SIZE];
    int32_t status;
    uint16_t remoteCoreId, remoteCoreEndPt, msgSize, ackMsgSize;

