TexasInstruments/mcupsdk-core/test/drivers/ipc_rpmsg/ipc_rpmsg_test_am263x/test_ipc_rpmsg_am263.c
    for(msg=0; msg<gMsgEchoCount; msg++)
    {
        snprintf(msgBuf, MAX_MSG_SIZE-1, "%d", msg);
        msgBuf[MAX_MSG_SIZE-1] = 0;
        msgSize = strlen(msgBuf) + 1; /* count the terminating char as well */

        /* send the same message to all cores */
        for(i=0; gRemoteCoreId[i]!=CSL_CORE_ID_MAX; i++ )
        {
            if(gRemoteCoreId[i] != IpcNotify_getSelfCoreId())
            {
                /*
                 * Temporary fix for code hang issue.
                 * Replaced "SystemP_WAIT_FOREVER" with 2 second timeout.
                 */
                status = RPMessage_send(
                    msgBuf, msgSize,
                    gRemoteCoreId[i], gServerEndPt,
                    RPMessage_getLocalEndPt(&gClientMsgObject),
                    ClockP_usecToTicks(RPMSG_SEND_TIMEOUT));
                TEST_ASSERT_EQUAL_INT32(SystemP_SUCCESS, status);
            }
        }
        /* wait for response from all cores */
        for(i=0; gRemoteCoreId[i]!=CSL_CORE_ID_MAX; i++ )
        {
            if(gRemoteCoreId[i] != IpcNotify_getSelfCoreId())
            {
                /* set 'ackMsgSize' to size of recv buffer,
                * after return `msgSize` contains actual size of valid data in recv buffer
                */
                ackMsgSize = sizeof(ackMsgBuf);
                ackMsgBuf[0] = 0;
                status = RPMessage_recv(&gClientMsgObject,
                    ackMsgBuf, &ackMsgSize,
                    &remoteCoreId, &remoteCoreEndPt,
                    SystemP_WAIT_FOREVER);
                TEST_ASSERT_EQUAL_INT32(SystemP_SUCCESS, status);
                TEST_ASSERT_EQUAL_UINT16(gServerEndPt, remoteCoreEndPt);
                TEST_ASSERT_EQUAL_UINT16(msgSize, ackMsgSize);
                TEST_ASSERT_EQUAL_INT32( 0, strcmp(ackMsgBuf, msgBuf));
            }
        }
    }

    /* wait for all cores to have executed upto this point
     * if we dont get sync from cores then message exchange between some core's has failed
     */
    IpcNotify_syncAll(SystemP_WAIT_FOREVER);
}

/* message exchange with one core, this is used to measure message exchange latency */
void test_rpmsgOneToOne(void *args)
{
    Test_Args *pTestArgs = (Test_Args*)args;
    uint16_t remoteCoreId = pTestArgs->remoteCoreId;
    uint16_t msgSize = pTestArgs->msgSize;
    uint32_t echoMsgCount = pTestArgs->echoMsgCount;
    uint64_t curTime;
    uint32_t msg;
    static char msgBuf[MAX_MSG_SIZE];
    static char ackMsgBuf[MAX_MSG_SIZE];
    int32_t status;
    uint16_t remoteCoreEndPt, ackMsgSize;

    TEST_ASSERT_LESS_OR_EQUAL_UINT16(MAX_MSG_SIZE, msgSize);

    /* fill with known data, we dont check data integrity in this test since
     * we want to focus on performance here
     *
     * Data integrity is tested in test_rpmsgAnyToAny
     */
    memset(msgBuf, 0xAA, MAX_MSG_SIZE);

    curTime = ClockP_getTimeUsec();

    for(msg=0; msg<echoMsgCount; msg++)
    {
        status = RPMessage_send(
            msgBuf, msgSize,
            remoteCoreId, gServerEndPt,
            RPMessage_getLocalEndPt(&gClientMsgObject),
            SystemP_WAIT_FOREVER);
        TEST_ASSERT_EQUAL_INT32(SystemP_SUCCESS, status);

        ackMsgSize = sizeof(ackMsgBuf);
        status = RPMessage_recv(&gClientMsgObject,
            ackMsgBuf, &ackMsgSize,
            &remoteCoreId, &remoteCoreEndPt,
            SystemP_WAIT_FOREVER);
        TEST_ASSERT_EQUAL_INT32(SystemP_SUCCESS, status);
        TEST_ASSERT_EQUAL_UINT16(msgSize, ackMsgSize);
    }

    curTime = ClockP_getTimeUsec() - curTime;

    gIpcPerfObj[gIpcPerfCnt].remoteCoreId = remoteCoreId;
    gIpcPerfObj[gIpcPerfCnt].msgSize = msgSize;
    gIpcPerfObj[gIpcPerfCnt].msgLatency = curTime;
    gIpcPerfCnt++;
    DebugP_assert(gIpcPerfCnt < MAX_IPC_RPMSG_PERF_CNT);

}

/* Test for dynamic coverage of RPMessage_recv for dataLen < header dataLen */
void test_rpmsgOneToOneDataLenError(void *args)
{
    Test_Args *pTestArgs = (Test_Args*)args;
    uint16_t remoteCoreId = pTestArgs->remoteCoreId;
    uint16_t msgSize = pTestArgs->msgSize;
    static char msgBuf[MAX_MSG_SIZE];
    static char ackMsgBuf[2];
    int32_t status;
    uint16_t remoteCoreEndPt, ackMsgSize;
    remoteCoreEndPt = 0U;

    TEST_ASSERT_LESS_OR_EQUAL_UINT16(MAX_MSG_SIZE, msgSize);

    /* fill with known data, we dont check data integrity in this test since
     * we want to focus on performance here
     *
     * Data integrity is tested in test_rpmsgAnyToAny
     */
    memset(msgBuf, 0xAA, MAX_MSG_SIZE);

        status = RPMessage_send(
            msgBuf, msgSize,
            remoteCoreId, gServerEndPt,
            RPMessage_getLocalEndPt(&gClientMsgObject),
            SystemP_WAIT_FOREVER);
        TEST_ASSERT_EQUAL_INT32(SystemP_SUCCESS, status);

        ackMsgSize = sizeof(ackMsgBuf);
        status = RPMessage_recv(&gClientMsgObject,
            ackMsgBuf, &ackMsgSize,
            &remoteCoreId, &remoteCoreEndPt,
            SystemP_WAIT_FOREVER);
        TEST_ASSERT_EQUAL_INT32(SystemP_SUCCESS, status);

}

/* In this test
    - we do message exchange with one core,
    - we send message back to back without waiting for ack
    - ack received in the callback mode
    - this tests fifo full and wait conditions
    - and test also callback mode of IPC
 */
void test_rpmsgOneToOneBackToBack(void *args)
{
    Test_Args *pTestArgs = (Test_Args*)args;
    uint16_t remoteCoreId = pTestArgs->remoteCoreId;
    uint32_t echoMsgCount = pTestArgs->echoMsgCount;
    uint64_t curTime;
    uint32_t oldDebugLogZone;
    int32_t status;

    /* disable warning logs since we are testing for those, so it will clutter the output */
    oldDebugLogZone = DebugP_logZoneDisable(DebugP_LOG_ZONE_WARN);

    curTime = ClockP_getTimeUsec();

    for(msg=0; msg<echoMsgCount; msg++)
    {
        Msg_BackToBack msgObj;

        msgObj.curCount = msg;
        msgObj.maxCount = echoMsgCount;
        status = RPMessage_send(
            &msgObj, sizeof(msgObj),
            remoteCoreId, gServerEndPt,
            RPMessage_getLocalEndPt(&gAckMsgObject),
            SystemP_WAIT_FOREVER);
        ClockP_usleep(10);
        TEST_ASSERT_EQUAL_INT32(SystemP_SUCCESS, status);
    }
    status = SemaphoreP_pend(&gAckDoneSem, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_SUCCESS, status);

    curTime = ClockP_getTimeUsec() - curTime;

    DebugP_logZoneRestore(oldDebugLogZone);

    DebugP_log("[TEST IPC RPMSG] Messages sent = %d, remote core = %s \r\n",
                    echoMsgCount, SOC_getCoreName(remoteCoreId));
    DebugP_log("[TEST IPC RPMSG] Total execution time = %" PRId64 " usecs\r\n", curTime);
    DebugP_log("[TEST IPC RPMSG] Avg one-way message latency = %" PRId32 " nsec\r\n",
        (uint32_t)(curTime*1000u/(echoMsgCount*2)));
}

/* Ack message handler when messages are sent with rx notify handler registered, here after required messages are received semaphore is posted */
void test_rpmsgRxNotifyHandler(RPMessage_Object *obj, void *arg)
{
    Msg_BackToBack msg;
    uint16_t dataLen = sizeof(msg);
    uint16_t remoteCoreId, remoteEndPt;
    int32_t status;

    status = RPMessage_recv(obj, &msg, &dataLen, &remoteCoreId, &remoteEndPt, 0);
    DebugP_assertNoLog(status == SystemP_SUCCESS);
    DebugP_assertNoLog(dataLen == sizeof(Msg_BackToBack));
    DebugP_assertNoLog(remoteEndPt == gServerEndPt);

    if(msg.curCount == (msg.maxCount-1) )
    {
        SemaphoreP_Object *pDoneSem = (SemaphoreP_Object *)arg;

        SemaphoreP_post(pDoneSem);
    }
}

/* In this test
    - we do message exchange with one core,
    - we use rx notify callback and see if it is getting invoked
    - we also test calling RPMessage_recv within the callback itself
 */
void test_rpmsgRxNotifyCallback(void *args)
{
    Test_Args *pTestArgs = (Test_Args*)args;
    uint16_t remoteCoreId = pTestArgs->remoteCoreId;
    uint32_t echoMsgCount = pTestArgs->echoMsgCount;
    uint32_t msg;
    int32_t status;

    for(msg=0; msg<echoMsgCount; msg++)
    {
        Msg_BackToBack msgObj;

        msgObj.curCount = msg;
        msgObj.maxCount = echoMsgCount;
        status = RPMessage_send(
            &msgObj, sizeof(msgObj),
            remoteCoreId, gServerEndPt,
            RPMessage_getLocalEndPt(&gRxNotifyAckMsgObject),
            SystemP_WAIT_FOREVER);
        ClockP_usleep(10);
        TEST_ASSERT_EQUAL_INT32(SystemP_SUCCESS, status);
    }

