TexasInstruments/mcupsdk-core/test/drivers/ipc_rpmsg/ipc_rpmsg_test_am263x/test_ipc_rpmsg_am263.c
    status = SemaphoreP_pend(&gRxNotifyAckDoneSem, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_SUCCESS, status);

}

void test_rpmsgErrorChecks(void *args)
{
    int32_t status;
    uint32_t msg, fifoFullCount, msgCount, oldDebugLogZone;
    uint16_t msgSize, remoteCoreId, remoteEndPt;
    RPMessage_CreateParams rpmsgPrm;
    Msg_BackToBack msgObj;

    /* disable error and warning logs since we are testing for those, so it will clutter the output */
    oldDebugLogZone = DebugP_logZoneDisable(DebugP_LOG_ZONE_WARN | DebugP_LOG_ZONE_ERROR);

    /* message to send, set values such ack callback wont post a semaphore */
    msgObj.curCount = 0;
    msgObj.maxCount = 10;

    /* invalid local end point */
    RPMessage_CreateParams_init(&rpmsgPrm);
    rpmsgPrm.localEndPt = RPMESSAGE_MAX_LOCAL_ENDPT;
    status = RPMessage_construct(&gNullRpmsgObj, &rpmsgPrm);
    TEST_ASSERT_EQUAL_INT32(SystemP_FAILURE, status);

    /* already created end point */
    RPMessage_CreateParams_init(&rpmsgPrm);
    rpmsgPrm.localEndPt = gServerEndPt;
    status = RPMessage_construct(&gNullRpmsgObj, &rpmsgPrm);
    TEST_ASSERT_EQUAL_INT32(SystemP_FAILURE, status);

    /* annouce to invalid core ID */
    status = RPMessage_announce(CSL_CORE_ID_MAX, 0, "test");
    TEST_ASSERT_EQUAL_INT32(SystemP_FAILURE, status);

    /* send to invalid core ID */
    status = RPMessage_send(&msgObj, sizeof(msgObj), CSL_CORE_ID_MAX,
                    gServerEndPt, gAckEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_FAILURE, status);

    /* send with NULL data */
    status = RPMessage_send(NULL, sizeof(msgObj), CSL_CORE_ID_R5FSS0_1,
                    gServerEndPt, gAckEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_FAILURE, status);

    /* send with zero size data  */
    status = RPMessage_send(&msgObj, 0, CSL_CORE_ID_R5FSS0_1,
                    gServerEndPt, gAckEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_FAILURE, status);

    /* send to end pt that is not created on remote,
       this is allowed, recevied message is dropped */
    status = RPMessage_send(&msgObj, sizeof(msgObj), CSL_CORE_ID_R5FSS0_1,
                    gNullEndPt, gAckEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_SUCCESS, status);
    /* set reply to end pt that is not created on local,
       this is allowed, ack message is dropped */
    status = RPMessage_send(&msgObj, sizeof(msgObj), CSL_CORE_ID_R5FSS0_1,
                    gServerEndPt, gNullEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_SUCCESS, status);

    /* send back to back messages without waiting, there should be timeout conditon
       due to queue full many times
     */
    fifoFullCount = 0;
    msgCount = 1000;
    for(msg=0; msg<msgCount; msg++)
    {
        status = RPMessage_send(&msgObj, sizeof(msgObj), CSL_CORE_ID_R5FSS0_1,
                        gServerEndPt, gAckEndPt, SystemP_NO_WAIT);
         ClockP_usleep(10);
        if(status == SystemP_TIMEOUT)
        {
            fifoFullCount++;
        }
    }
    /* send one message waiting for space in FIFO just to check a success case after failure */
    status = RPMessage_send(&msgObj, sizeof(msgObj), CSL_CORE_ID_R5FSS0_1,
                        gServerEndPt, gAckEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_SUCCESS, status);

    DebugP_log("[TEST IPC RPMSG] Messages sent = %d \r\n", msgCount);
    DebugP_log("[TEST IPC RPMSG] FIFO Full count = %d \r\n", fifoFullCount);

    TEST_ASSERT_GREATER_OR_EQUAL_UINT32(0, fifoFullCount);

    /* use recv API on a end point which is created in handler mode */
    status = RPMessage_recv(&gAckMsgObject, &msgObj, &msgSize, &remoteCoreId, &remoteEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_FAILURE, status);

    /* recv error checks, first create rpmsg object */
    RPMessage_CreateParams_init(&rpmsgPrm);
    rpmsgPrm.localEndPt = gNullEndPt;
    status = RPMessage_construct(&gNullRpmsgObj, &rpmsgPrm);
    TEST_ASSERT_EQUAL_INT32(SystemP_SUCCESS, status);

    /* parameter checks */
    status = RPMessage_recv(&gNullRpmsgObj, NULL, &msgSize, &remoteCoreId, &remoteEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_FAILURE, status);
    status = RPMessage_recv(&gNullRpmsgObj, &msgObj, NULL, &remoteCoreId, &remoteEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_FAILURE, status);
    status = RPMessage_recv(&gNullRpmsgObj, &msgObj, &msgSize, NULL, &remoteEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_FAILURE, status);
    status = RPMessage_recv(&gNullRpmsgObj, &msgObj, &msgSize, &remoteCoreId, NULL, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_FAILURE, status);
    /* timeout check */
    status = RPMessage_recv(&gNullRpmsgObj, &msgObj, &msgSize, &remoteCoreId, &remoteEndPt, 10);
    TEST_ASSERT_EQUAL_INT32(SystemP_TIMEOUT, status);
    status = RPMessage_recv(&gNullRpmsgObj, &msgObj, &msgSize, &remoteCoreId, &remoteEndPt, 0);
    TEST_ASSERT_EQUAL_INT32(SystemP_TIMEOUT, status);

    /* unblock test, post unblock and then waitforever, it should return with a timeout status */
    RPMessage_unblock(&gNullRpmsgObj);
    status = RPMessage_recv(&gNullRpmsgObj, &msgObj, &msgSize, &remoteCoreId, &remoteEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_TIMEOUT, status);

    /* cleanup */
    RPMessage_destruct(&gNullRpmsgObj);

    DebugP_logZoneRestore(oldDebugLogZone);
}

/* Main core Test for Dynamic coverage of RPMessage_send to get status of RPMessage_vringGetEmptyTxBuf as SYSTEMP_Failure */
void test_ipc_rpmsg_sendmsgto_core0_1_timeout(void *args)
{
    char msgBuf[MAX_MSG_SIZE];
    int32_t status;
    uint32_t i;
    uint16_t msgSize;
    Test_Args *pTestArgs = (Test_Args*)args;
    uint16_t remoteCoreId = pTestArgs->remoteCoreId;
    msgBuf[MAX_MSG_SIZE-1] = 0;
    msgSize = strlen(msgBuf) + 1; /* count the terminating char as well */
    RPMessage_Params rpmsgParams;

    IpcNotify_sendSync(remoteCoreId);
    IpcNotify_waitSync(remoteCoreId, SystemP_WAIT_FOREVER);
    ClockP_usleep(1000);

