TexasInstruments/mcupsdk-core/test/drivers/ipc_rpmsg/ipc_rpmsg_test_am263x/test_ipc_rpmsg_am263.c
    for(i=0; i<8; i++){
        status = RPMessage_send(
            msgBuf, msgSize,
            remoteCoreId, gRemoteServiceEndPt,
            RPMessage_getLocalEndPt(&gAckReplyMsgObject),
            SystemP_WAIT_FOREVER);
    }
    status = RPMessage_send(
            msgBuf, msgSize,
            remoteCoreId, gRemoteServiceEndPt,
            RPMessage_getLocalEndPt(&gAckReplyMsgObject),
            SystemP_NO_WAIT);
    TEST_ASSERT_EQUAL_INT32(SystemP_TIMEOUT, status);
    ClockP_usleep(6000);
    IpcNotify_sendSync(remoteCoreId);
    IpcNotify_waitSync(remoteCoreId, SystemP_WAIT_FOREVER);

    RPMessage_deInit();
    /* initialize parameters to default */
    RPMessage_Params_init(&rpmsgParams);

     /* VRING mapping from source core to destination core, '-1' means NO VRING,
            r5fss0_0 => {"r5fss0_0":-1,"r5fss0_1":0,"r5fss1_0":1,"r5fss1_1":2}
            r5fss0_1 => {"r5fss0_0":3,"r5fss0_1":-1,"r5fss1_0":4,"r5fss1_1":5}
            r5fss1_0 => {"r5fss0_0":6,"r5fss0_1":7,"r5fss1_0":-1,"r5fss1_1":8}
            r5fss1_1 => {"r5fss0_0":9,"r5fss0_1":10,"r5fss1_0":11,"r5fss1_1":-1}
         */
        /* TX VRINGs */
        rpmsgParams.vringTxBaseAddr[CSL_CORE_ID_R5FSS0_1] = (uintptr_t)gRPMessageVringMem[0];
        rpmsgParams.vringTxBaseAddr[CSL_CORE_ID_R5FSS1_0] = (uintptr_t)gRPMessageVringMem[1];
        rpmsgParams.vringTxBaseAddr[CSL_CORE_ID_R5FSS1_1] = (uintptr_t)gRPMessageVringMem[2];
        /* RX VRINGs */
        rpmsgParams.vringRxBaseAddr[CSL_CORE_ID_R5FSS0_1] = (uintptr_t)gRPMessageVringMem[3];
        rpmsgParams.vringRxBaseAddr[CSL_CORE_ID_R5FSS1_0] = (uintptr_t)gRPMessageVringMem[6];
        rpmsgParams.vringRxBaseAddr[CSL_CORE_ID_R5FSS1_1] = (uintptr_t)gRPMessageVringMem[9];
        /* Other VRING properties */
        rpmsgParams.vringSize = 1312U;
        rpmsgParams.vringNumBuf = 8U;
        rpmsgParams.vringMsgSize = 128U;

    /* initialize the IPC RP Message module */
    status = RPMessage_init(&rpmsgParams);
    DebugP_assert(status==SystemP_SUCCESS);

}

/*Test for MCDC coverage of RPMessage_send API */
void test_ipc_rpmsg_sendmsgto_core0_1_errorcheck(void *args)
{
    char msgBuf[MAX_MSG_SIZE];
    int32_t status;
    uint32_t i;
    uint16_t msgSize;
    Test_Args *pTestArgs = (Test_Args*)args;
    uint16_t remoteCoreId = pTestArgs->remoteCoreId;
    msgBuf[MAX_MSG_SIZE-1] = 0;
    msgSize = strlen(msgBuf) + 1; /* count the terminating char as well */

    for(i=0; i<9; i++){
        status = RPMessage_send(
            msgBuf, msgSize,
            remoteCoreId, gRemoteServiceEndPt,
            RPMessage_getLocalEndPt(&gAckReplyMsgObject),
            SystemP_WAIT_FOREVER);
    }
    TEST_ASSERT_EQUAL_INT32(SystemP_SUCCESS, status);
}

/* Remote core Test for Dynamic coverage of RPMessage_send to get status of RPMessage_vringGetEmptyTxBuf as SYSTEMP_Failure */
void test_ipc_rpmsg_sendmsgto_core0_0_timeout(void *args)
{

    int32_t status;
    Test_Args *pTestArgs = (Test_Args*)args;
    uint16_t remoteCoreId = pTestArgs->remoteCoreId;
    RPMessage_Params rpmsgParams;

    IpcNotify_sendSync(remoteCoreId);
    IpcNotify_waitSync(remoteCoreId, SystemP_WAIT_FOREVER);
    RPMessage_deInit();
    ClockP_usleep(5000);
    /* initialize parameters to default */
    RPMessage_Params_init(&rpmsgParams);

    /* VRING mapping from source core to destination core, '-1' means NO VRING,
            r5fss0_0 => {"r5fss0_0":-1,"r5fss0_1":0,"r5fss1_0":1,"r5fss1_1":2}
            r5fss0_1 => {"r5fss0_0":3,"r5fss0_1":-1,"r5fss1_0":4,"r5fss1_1":5}
            r5fss1_0 => {"r5fss0_0":6,"r5fss0_1":7,"r5fss1_0":-1,"r5fss1_1":8}
            r5fss1_1 => {"r5fss0_0":9,"r5fss0_1":10,"r5fss1_0":11,"r5fss1_1":-1}
         */
        /* TX VRINGs */
        rpmsgParams.vringTxBaseAddr[CSL_CORE_ID_R5FSS0_0] = (uintptr_t)gRPMessageVringMem[3];
        rpmsgParams.vringTxBaseAddr[CSL_CORE_ID_R5FSS1_0] = (uintptr_t)gRPMessageVringMem[4];
        rpmsgParams.vringTxBaseAddr[CSL_CORE_ID_R5FSS1_1] = (uintptr_t)gRPMessageVringMem[5];
        /* RX VRINGs */
        rpmsgParams.vringRxBaseAddr[CSL_CORE_ID_R5FSS0_0] = (uintptr_t)gRPMessageVringMem[0];
        rpmsgParams.vringRxBaseAddr[CSL_CORE_ID_R5FSS1_0] = (uintptr_t)gRPMessageVringMem[7];
        rpmsgParams.vringRxBaseAddr[CSL_CORE_ID_R5FSS1_1] = (uintptr_t)gRPMessageVringMem[10];
        /* Other VRING properties */
        rpmsgParams.vringSize = 1312U;
        rpmsgParams.vringNumBuf = 8U;
        rpmsgParams.vringMsgSize = 128U;

    /* initialize the IPC RP Message module */
    status = RPMessage_init(&rpmsgParams);
    DebugP_assert(status==SystemP_SUCCESS);

    TEST_ASSERT_EQUAL_INT32(SystemP_SUCCESS, status);

    IpcNotify_sendSync(remoteCoreId);
    IpcNotify_waitSync(remoteCoreId, SystemP_WAIT_FOREVER);
}

/* This code executes on remote core, i.e not on main core */
void test_ipc_remote_core_start()
{
    Test_Args testArgs;
    UNITY_BEGIN();

    /* announce endpt to main core, this is need for annouce test */
    RPMessage_announce(gMainCoreId, RPMessage_getLocalEndPt(&gServerMsgObject), SERVER_NAME);

    /* Run any to any test */
    test_rpmsgAnyToAny(NULL);

    /*Run this test only when the remote core is 0_1*/
    if(IpcNotify_getSelfCoreId() == CSL_CORE_ID_R5FSS0_1)
    {
        testArgs.remoteCoreId = CSL_CORE_ID_R5FSS0_0;
        RUN_TEST(test_ipc_rpmsg_sendmsgto_core0_0_timeout, 10614, &testArgs);
    }

    /* wait for ever, now onwards main core will initaite all requests
     * to the server task, which will simply echo the messages
     */
    ClockP_sleep(SystemP_WAIT_FOREVER);

    UNITY_END();
}

/* This code executes on main core, i.e not on remote core */
void test_ipc_main_core_start()
{
    uint32_t i;

    Test_Args testArgs;

    UNITY_BEGIN();
    testArgs.remoteCoreId = CSL_CORE_ID_R5FSS0_1;
    RUN_TEST(test_ipc_rpmsg_sendmsgto_core0_1_errorcheck, 10616, &testArgs);

    /* These MUST be the first tests to run */
    RUN_TEST(test_rpmsgControlEndPt, 296, NULL);
    RUN_TEST(test_rpmsgAnyToAny, 297, NULL);

    /* now you can comment tests if needed to debug a specific test */
    testArgs.echoMsgCount = 1000; /* this value is used by all later tests */
    /* performance test with minimum payload size */
    testArgs.msgSize = 4;
    testArgs.remoteCoreId = CSL_CORE_ID_R5FSS0_1;
    RUN_TEST(test_rpmsgOneToOne, 298, &testArgs);

    #if defined(SOC_AM64X) || defined(SOC_AM243X) || defined(SOC_AM263X)
    testArgs.remoteCoreId = CSL_CORE_ID_R5FSS1_0;
    RUN_TEST(test_rpmsgOneToOne, 300, &testArgs);
    testArgs.remoteCoreId = CSL_CORE_ID_R5FSS1_1;
    RUN_TEST(test_rpmsgOneToOne, 301, &testArgs);
    #endif

